{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 117,
   "metadata": {},
   "outputs": [],
   "source": [
    "import json\n",
    "from itertools import combinations\n",
    "from collections import defaultdict\n",
    "import redis\n",
    "from prettytable import PrettyTable\n",
    "from hashlib import sha256\n",
    "from py2neo import Graph, Node, Relationship\n",
    "\n",
    "def subtract_lists(arr_1, arr_2):\n",
    "    arr_1 = list(map(int, arr_1))\n",
    "    arr_2 = list(map(int, arr_2))\n",
    "    return list(map(lambda x: x[0] - x[1], zip(arr_1, arr_2)))\n",
    "\n",
    "with open('data/episodes_2.json', 'r') as open_file:\n",
    "    data_j = json.loads(open_file.read())\n",
    "\n",
    "graph_list = list()\n",
    "\n",
    "for episode in data_j['episodes']:\n",
    "    scene_dict = defaultdict(int)\n",
    "    for scene in episode['scenes']:\n",
    "        if len(scene['characters']) < 2:\n",
    "            continue\n",
    "        scene_time = sum(list(map(lambda x: 60**(2-x[0])*x[1], enumerate(subtract_lists(scene['sceneEnd'].split(':'), scene['sceneStart'].split(':'))))))\n",
    "        for x in combinations(list(map(lambda x: x['name'], scene['characters'])), 2):\n",
    "            scene_dict[tuple(sorted(x))] += scene_time\n",
    "    graph_list.append((episode['episodeTitle'], scene_dict,))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 92,
   "metadata": {},
   "outputs": [],
   "source": [
    "graph = redis.Redis(host='localhost', port=13, db=0)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 93,
   "metadata": {},
   "outputs": [],
   "source": [
    "for episode_info in graph_list:\n",
    "    for character_names, weight in episode_info[1].items():\n",
    "        buff = dict()\n",
    "        buff['character_1'] = character_names[0].replace(' ', '_').replace('\\'', '')\n",
    "        buff['character_2'] = character_names[1].replace(' ', '_').replace('\\'', '')\n",
    "        buff['episode_name'] = episode_info[0].replace(',', '_').replace(' ', '_').replace('\\'', '')\n",
    "        reply = graph.execute_command('GRAPH.QUERY', \n",
    "            'social', \n",
    "            f\"CREATE (:Character {{name:'{buff['character_1']}'}})-[:{buff['episode_name']}]->(:Character {{name:'{buff['character_2']}'}})\")\n",
    "        buff = None"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 94,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "+-----------------------+------------+\n",
      "|        HeroName       | CountEdges |\n",
      "+-----------------------+------------+\n",
      "|      b'Jon_Snow'      |    476     |\n",
      "|  b'Tyrion_Lannister'  |    427     |\n",
      "| b'Daenerys_Targaryen' |    401     |\n",
      "|  b'Cersei_Lannister'  |    395     |\n",
      "|     b'Sansa_Stark'    |    370     |\n",
      "|     b'Arya_Stark'     |    297     |\n",
      "|   b'Jaime_Lannister'  |    287     |\n",
      "|    b'Jorah_Mormont'   |    275     |\n",
      "|     b'Lord_Varys'     |    261     |\n",
      "|    b'Samwell_Tarly'   |    252     |\n",
      "+-----------------------+------------+\n"
     ]
    }
   ],
   "source": [
    "info = graph.execute_command('GRAPH.QUERY', 'social',\n",
    "    f'''\n",
    "    MATCH (n)<-[r]->(z)\n",
    "    WITH n.name as name, count(r) as size \n",
    "    RETURN name, size \n",
    "    ORDER BY size DESC \n",
    "    LIMIT 10\n",
    "''')\n",
    "\n",
    "table = PrettyTable()\n",
    "table.field_names = [\"HeroName\", \"CountEdges\",]\n",
    "for x in info[1:-1][0]:\n",
    "    table.add_row(x)\n",
    "print(table)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 216,
   "metadata": {},
   "outputs": [
    {
     "ename": "AttributeError",
     "evalue": "'Graph' object has no attribute 'execute_command'",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mAttributeError\u001b[0m                            Traceback (most recent call last)",
      "\u001b[0;32m<ipython-input-216-c9a63c6027bd>\u001b[0m in \u001b[0;36m<module>\u001b[0;34m\u001b[0m\n\u001b[0;32m----> 1\u001b[0;31m graph.execute_command('GRAPH.QUERY', 'social',\n\u001b[0m\u001b[1;32m      2\u001b[0m     f'''\n\u001b[1;32m      3\u001b[0m     \u001b[0mMATCH\u001b[0m \u001b[0;34m(\u001b[0m\u001b[0mn\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m      4\u001b[0m     \u001b[0mDETACH\u001b[0m \u001b[0mDELETE\u001b[0m \u001b[0mn\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m      5\u001b[0m ''')\n",
      "\u001b[0;31mAttributeError\u001b[0m: 'Graph' object has no attribute 'execute_command'"
     ]
    }
   ],
   "source": [
    "graph.execute_command('GRAPH.QUERY', 'social',\n",
    "    f'''\n",
    "    MATCH (n)\n",
    "    DETACH DELETE n\n",
    "''')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 200,
   "metadata": {},
   "outputs": [],
   "source": [
    "graph_redis = redis.Redis(host='localhost', port=6379, db=5)\n",
    "graph_neo4j = Graph(\"bolt://neo4j:neo4j!@localhost:7687\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 182,
   "metadata": {},
   "outputs": [],
   "source": [
    "for episode_info in graph_list:\n",
    "    for character_names, weight in episode_info[1].items():\n",
    "        node_1 = Node(\"Character\", name=character_names[0].replace(' ', '_'))\n",
    "        node_2 = Node(\"Character\", name=character_names[1].replace(' ', '_'))\n",
    "        relationship = Relationship(node_1, episode_info[0].replace(' ', '_'), node_2, weight=weight)\n",
    "        graph_neo4j.merge(relationship, \"Character\", \"name\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 213,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "b2eae40b75cf58aef7c3f3ee118a748e128b27976c23ef34397d88d79b66e7f2\n",
      "+--------------------+------------+\n",
      "|      HeroName      | CountEdges |\n",
      "+--------------------+------------+\n",
      "|      Jon_Snow      |    476     |\n",
      "|  Tyrion_Lannister  |    427     |\n",
      "| Daenerys_Targaryen |    401     |\n",
      "|  Cersei_Lannister  |    395     |\n",
      "|    Sansa_Stark     |    370     |\n",
      "|     Arya_Stark     |    297     |\n",
      "|  Jaime_Lannister   |    287     |\n",
      "|   Jorah_Mormont    |    275     |\n",
      "|     Lord_Varys     |    261     |\n",
      "|   Samwell_Tarly    |    252     |\n",
      "+--------------------+------------+\n"
     ]
    }
   ],
   "source": [
    "def get_cache(cursor_redis, cursor_neo4j, query, timeout):\n",
    "    query_hash = sha256(query.encode()).hexdigest()\n",
    "    print(query_hash)\n",
    "    if not cursor_redis.exists(query_hash):\n",
    "        print('not cache')\n",
    "        cursor_redis.set(query_hash, json.dumps(list(cursor_neo4j.run(query))), timeout)\n",
    "    return json.loads(cursor_redis.get(query_hash))\n",
    "\n",
    "query = f'''\n",
    "    MATCH (n)<-[r]->(z)\n",
    "    WITH n.name as name, count(r) as size \n",
    "    RETURN name, size \n",
    "    ORDER BY size DESC \n",
    "    LIMIT 10\n",
    "'''\n",
    "\n",
    "info = get_cache(graph_redis, graph_neo4j, query, 20)\n",
    "\n",
    "table = PrettyTable()\n",
    "table.field_names = [\"HeroName\", \"CountEdges\",]\n",
    "for x in info:\n",
    "    table.add_row([*x])\n",
    "print(table)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 215,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(No data)"
      ]
     },
     "execution_count": 215,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph.run(f'''\n",
    "    MATCH (n)\n",
    "    DETACH DELETE n\n",
    "''')"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
